# PipePlumbingFixtureFlowData Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipePlumbingFixtureFlowData Class
Members See Also
---
The input and output data used by external servers for calculation of the pipe plumbing fixture flow.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class PipePlumbingFixtureFlowData : IDisposable
```

Visual Basic
---
```text
Public Class PipePlumbingFixtureFlowData _
	Implements IDisposable
```

Visual C++
---
```text
public ref class PipePlumbingFixtureFlowData : IDisposable
```

# Remarks
FlowConfiguration, FixtureUnits, FlowConversionMode, and DimensionFlow are input field values for the calculation. Flow is output field value for the calculation.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Plumbing..::..PipePlumbingFixtureFlowData
# See Also
PipePlumbingFixtureFlowData Members
Autodesk.Revit.DB.Plumbing Namespace